app/controllers/ssl_controller.rb

SELECT "users".* FROM "users" WHERE "users"."admin" = 't' ORDER BY "users"."sign_in_count" DESC, "users"."email" ASC
---
  def users
  	@users = []
  	# Show admins all users so they can promote users
  	if current_user.try(:admin?)
  		@users = User.all.order(admin: :desc, sign_in_count: :desc, email: :asc)